import os
from string import Template


SYSTEM_PROMPT = Template(
    "\n".join(
        [
            "أنت مساعد لتوليد استجابة للمستخدم.",
            "سيتم تزويدك بمجموعة من المستندات المتعلقة باستفسار المستخدم.",
            "يجب عليك توليد استجابة بناءً على المستندات المقدمة.",
            "تجاهل المستندات غير المرتبطة باستفسار المستخدم.",
            "يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد استجابة.",
            "يجب أن تكون الاستجابة بنفس لغة استفسار المستخدم.",
            "كن مهذبًا ومحترمًا مع المستخدم.",
            "كن دقيقًا ومختصرًا في استجابتك وتجنب المعلومات غير الضرورية.",
        ]
    )
)

DOCUMENT_PROMPT = Template(
    "\n".join(
        [
            "## رقم المستند: $doc_num",
            "### المحتوى: $chunk_text",
        ]
    )
)

FOOTER_PROMPT = Template(
    "\n".join(
        [
            "استنادًا فقط إلى المستندات أعلاه، يرجى توليد إجابة للمستخدم.",
            "## السؤال:",
            "$query",
            "",
            "## الإجابة: ",
        ]
    )
)


def main():
    """Entry Point for the Program."""
    print(
        f"Welcome from `{os.path.basename(__file__).split('.')[0]}` Module. Nothing to do ^_____^!"
    )


if __name__ == "__main__":
    main()
